# SetTransparency Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorWithTransparency..::..SetTransparency Method
ColorWithTransparency Class See Also
---
set transparency
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public void SetTransparency(
	uint transparency
)
```

Visual Basic
---
```text
Public Sub SetTransparency ( _
	transparency As UInteger _
)
```

Visual C++
---
```text
public:
void SetTransparency(
	unsigned int transparency
)
```

# ### Parameters
transparency
    Type: System..::..UInt32 transparency
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The value is not valid. The valid range is 0 to 255. |

# See Also
ColorWithTransparency Class
Autodesk.Revit.DB Namespace